In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
titanic['class'].unique() # ['First', 'Second', 'Third']
titanic['sex'].unique()  # ['male', 'female']
titanic['alive'].unique() # ['no', 'yes']

array(['no', 'yes'], dtype=object)

In [10]:
titanic_codes = {
    'First': 0,
    'Second': 1,
    'Third': 2
}
titanic['map_class_codes'] = titanic['class'].map(titanic_codes)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,map_class_codes,map_sex_codes,map_alive_codes
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,0,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,1,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,1,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0,0

In [11]:
titanic_codes = {
    'male': 0,
    'female':1
}
titanic['map_sex_codes'] = titanic['sex'].map(titanic_codes)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,map_class_codes,map_sex_codes,map_alive_codes
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,0,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,1,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,1,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0,0

In [12]:
titanic_codes = {
    'no': 0,
    'yes':1
}
titanic['map_alive_codes'] = titanic['alive'].map(titanic_codes)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,map_class_codes,map_sex_codes,map_alive_codes
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,0,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,1,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,1,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0,0

In [19]:
x,y = pd.factorize(titanic['class'])
titanic['factorize_class'] = x

In [17]:
x,y = pd.factorize(titanic['sex'])
titanic['factorize_sex'] = x

In [18]:
x,y = pd.factorize(titanic['alive'])
titanic['factorize_alive'] = x
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,deck,embark_town,alive,alone,map_class_codes,map_sex_codes,map_alive_codes,factorize_class,factorize_sex,factorize_alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,NaN,Southampton,no,False,2,0,0,0,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,C,Cherbourg,yes,False,0,1,1,1,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,NaN,Southampton,yes,True,2,1,1,0,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,...,C,Southampton,yes,False,0,1,1,1,1,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,...,NaN,Southampton,no,True,2,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,...,NaN,Southampton,no,True,1,0,0,2,0,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,...,B,Southampton,yes,True,0,1,1,1,1,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,...,NaN,Southampton,no,False,2,1,0,0,1,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,...,C,Cherbourg,yes,True,0,0,1,1,0,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,...,NaN,Queenstown,no,True,2,0,0,0,0,0

In [22]:
titanic['class'] = titanic['class'].astype('category')
titanic['class_cat_codes'] = titanic['class'].cat.codes

In [24]:
titanic['sex'] = titanic['sex'].astype('category')
titanic['sex_cat_codes'] = titanic['sex'].cat.codes

In [26]:
titanic['alive'] = titanic['alive'].astype('category')
titanic['alive_cat_codes'] = titanic['alive'].cat.codes
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,map_class_codes,map_sex_codes,map_alive_codes,factorize_class,factorize_sex,factorize_alive,class_cat_codes,sex_class_codes,sex_cat_codes,alive_cat_codes
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,2,0,0,0,0,0,2,1,1,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,0,1,1,1,1,1,0,0,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,2,1,1,0,1,1,2,0,0,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,...,0,1,1,1,1,1,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,...,2,0,0,0,0,0,2,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,...,1,0,0,2,0,0,1,1,1,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,...,0,1,1,1,1,1,0,0,0,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,...,2,1,0,0,1,0,2,0,0,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,...,0,0,1,1,0,1,0,1,1,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,...,2,0,0,0,0,0,2,1,1,0

In [29]:
from sklearn.preprocessing import LabelEncoder
titanic['class_L_E'] = LabelEncoder().fit_transform(titanic['class'])

In [30]:
titanic['sex_L_E'] = LabelEncoder().fit_transform(titanic['sex'])

In [34]:
titanic['alive_L_E'] = LabelEncoder().fit_transform(titanic['alive'])

In [35]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,factorize_class,factorize_sex,factorize_alive,class_cat_codes,sex_class_codes,sex_cat_codes,alive_cat_codes,class_L_E,sex_L_E,alive_L_E
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,0,0,0,2,1,1,0,2,1,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,1,1,1,0,0,0,1,0,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,0,1,1,2,0,0,1,2,0,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,...,1,1,1,0,0,0,1,0,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,...,0,0,0,2,1,1,0,2,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,...,2,0,0,1,1,1,0,1,1,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,...,1,1,1,0,0,0,1,0,0,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,...,0,1,0,2,0,0,0,2,0,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,...,1,0,1,0,1,1,1,0,1,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,...,0,0,0,2,1,1,0,2,1,0

------

# One Hot Encoder Training

In [5]:
from sklearn.preprocessing import OneHotEncoder

In [38]:
titanic_training = sns.load_dataset('titanic')

In [46]:
onehot_titanic = pd.get_dummies(titanic_training,columns=['class'])
onehot_titanic['class_First'].dtype
onehot_titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone,class_First,class_Second,class_Third
0,0,3,male,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False,False,False,True
1,1,1,female,38.0,1,0,71.2833,C,woman,False,C,Cherbourg,yes,False,True,False,False
2,1,3,female,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True,False,False,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,C,Southampton,yes,False,True,False,False
4,0,3,male,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,man,True,NaN,Southampton,no,True,False,True,False
887,1,1,female,19.0,0,0,30.0000,S,woman,False,B,Southampton,yes,True,True,False,False
888,0,3,female,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,no,False,False,False,True
889,1,1,male,26.0,0,0,30.0000,C,man,True,C,Cherbourg,yes,True,True,False,False
890,0,3,male,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,no,True,False,False,True

In [48]:
onehot_titanic = pd.get_dummies(titanic_training,columns=['sex'])
onehot_titanic['sex_male'].dtype
onehot_titanic

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,sex_female,sex_male
0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,False,True
1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,False
2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,False
3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,True,False
4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,False,True
887,1,1,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,True,False
888,0,3,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,True,False
889,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,False,True
890,0,3,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,False,True

In [6]:
encoder = OneHotEncoder(sparse_output=False,handle_unknown='ignore')
titanic_class = ['class']

In [56]:
titanic_array_codes  = encoder.fit_transform(onehot_titanic[titanic_class])
titanic_array_codes

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.]], shape=(891, 3))

In [57]:
titanic_code = encoder.get_feature_names_out(titanic_class)
titanic_code

array(['class_First', 'class_Second', 'class_Third'], dtype=object)

In [62]:
onehot_titanic[titanic_code] = titanic_array_codes

In [64]:
onehot_titanic

,survived,pclass,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone,sex_female,sex_male,class_First,class_Second,class_Third
0,0,3,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False,False,True,0.0,0.0,1.0
1,1,1,38.0,1,0,71.2833,C,woman,False,C,Cherbourg,yes,False,True,False,1.0,0.0,0.0
2,1,3,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True,True,False,0.0,0.0,1.0
3,1,1,35.0,1,0,53.1000,S,woman,False,C,Southampton,yes,False,True,False,1.0,0.0,0.0
4,0,3,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True,False,True,0.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,man,True,NaN,Southampton,no,True,False,True,0.0,1.0,0.0
887,1,1,19.0,0,0,30.0000,S,woman,False,B,Southampton,yes,True,True,False,1.0,0.0,0.0
888,0,3,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,no,False,True,False,0.0,0.0,1.0
889,1,1,26.0,0,0,30.0000,C,man,True,C,Cherbourg,yes,True,False,True,1.0,0.0,0.0
890,0,3,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,no,True,False,True,0.0,0.0,1.0

In [67]:
onehot_titanic.drop(columns =['pclass'],inplace =True)

KeyError: "['pclass'] not found in axis"

In [68]:
onehot_titanic

,survived,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone,sex_female,sex_male,class_First,class_Second,class_Third
0,0,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False,False,True,0.0,0.0,1.0
1,1,38.0,1,0,71.2833,C,woman,False,C,Cherbourg,yes,False,True,False,1.0,0.0,0.0
2,1,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True,True,False,0.0,0.0,1.0
3,1,35.0,1,0,53.1000,S,woman,False,C,Southampton,yes,False,True,False,1.0,0.0,0.0
4,0,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True,False,True,0.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,27.0,0,0,13.0000,S,man,True,NaN,Southampton,no,True,False,True,0.0,1.0,0.0
887,1,19.0,0,0,30.0000,S,woman,False,B,Southampton,yes,True,True,False,1.0,0.0,0.0
888,0,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,no,False,True,False,0.0,0.0,1.0
889,1,26.0,0,0,30.0000,C,man,True,C,Cherbourg,yes,True,False,True,1.0,0.0,0.0
890,0,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,no,True,False,True,0.0,0.0,1.0

In [70]:
titanic_alive = ['alive']
titanic_coded_alive = encoder.fit_transform(onehot_titanic[titanic_alive])

In [71]:
alive_names_out = encoder.get_feature_names_out(titanic_alive)

In [72]:
onehot_titanic[alive_names_out] = titanic_coded_alive
onehot_titanic.drop(columns=['alive'],inplace=True)

In [73]:
onehot_titanic

,survived,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alone,sex_female,sex_male,class_First,class_Second,class_Third,alive_no,alive_yes
0,0,22.0,1,0,7.2500,S,man,True,NaN,Southampton,False,False,True,0.0,0.0,1.0,1.0,0.0
1,1,38.0,1,0,71.2833,C,woman,False,C,Cherbourg,False,True,False,1.0,0.0,0.0,0.0,1.0
2,1,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,True,True,False,0.0,0.0,1.0,0.0,1.0
3,1,35.0,1,0,53.1000,S,woman,False,C,Southampton,False,True,False,1.0,0.0,0.0,0.0,1.0
4,0,35.0,0,0,8.0500,S,man,True,NaN,Southampton,True,False,True,0.0,0.0,1.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,27.0,0,0,13.0000,S,man,True,NaN,Southampton,True,False,True,0.0,1.0,0.0,1.0,0.0
887,1,19.0,0,0,30.0000,S,woman,False,B,Southampton,True,True,False,1.0,0.0,0.0,0.0,1.0
888,0,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,False,True,False,0.0,0.0,1.0,1.0,0.0
889,1,26.0,0,0,30.0000,C,man,True,C,Cherbourg,True,False,True,1.0,0.0,0.0,0.0,1.0
890,0,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,True,False,True,0.0,0.0,1.0,1.0,0.0

In [2]:
titanic_2 = sns.load_dataset('titanic')

In [3]:
titanic_columns = (['alive', 'survived'])

In [8]:
array_titanic = encoder.fit_transform(titanic_2[titanic_columns])
array_titanic

array([[1., 0., 1., 0.],
       [0., 1., 0., 1.],
       [0., 1., 0., 1.],
       ...,
       [1., 0., 1., 0.],
       [0., 1., 0., 1.],
       [1., 0., 1., 0.]], shape=(891, 4))

In [9]:
code_titanic = encoder.get_feature_names_out(titanic_columns)

In [10]:
titanic_2[code_titanic] = array_titanic

In [11]:
titanic_2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,alive_no,alive_yes,survived_0,survived_1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1.0,0.0,1.0,0.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0.0,1.0,0.0,1.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0.0,1.0,0.0,1.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0.0,1.0,0.0,1.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1.0,0.0,1.0,0.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0.0,1.0,0.0,1.0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,1.0,0.0,1.0,0.0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0.0,1.0,0.0,1.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1.0,0.0,1.0,0.0

In [12]:
titanic_2.drop(columns=(['survived','alive']),inplace=True)

In [13]:
titanic_2

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone,alive_no,alive_yes,survived_0,survived_1
0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,1.0,0.0,1.0,0.0
1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,False,0.0,1.0,0.0,1.0
2,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,0.0,1.0,0.0,1.0
3,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,False,0.0,1.0,0.0,1.0
4,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,True,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,True,1.0,0.0,1.0,0.0
887,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,True,0.0,1.0,0.0,1.0
888,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,False,1.0,0.0,1.0,0.0
889,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,True,0.0,1.0,0.0,1.0
890,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,True,1.0,0.0,1.0,0.0